# ProhibitDeletionLightSource Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RenderFailures..::..ProhibitDeletionLightSource Property
BuiltInFailures..::..RenderFailures Class See Also
---
The light source cannot be deleted with UI.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProhibitDeletionLightSource { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProhibitDeletionLightSource As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProhibitDeletionLightSource {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RenderFailures Class
Autodesk.Revit.DB Namespace